wiki/2016-05-29-web-div-css-center.html
<!DOCTYPE html>
<html lang="zh">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://bruceasu.github.io/rss.xml"
      title="RSS feed for https://bruceasu.github.io/"/>
<title>div纯css自适应居中</title>
<meta name="author" content="Bruce">
<meta name="referrer" content="no-referrer">
<link href= "/styles/org-manual.css" rel="stylesheet" type="text/css" />
<link rel="icon" href="static/favicon.ico">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta http-equiv="content-type" content="text/html; charset=utf-8" />
<link rel="stylesheet" href="/styles/font.css">
<link rel="stylesheet" media="screen and (min-width: 600px)" href="/styles/post.css">
<link rel="stylesheet" media="screen and (max-width: 600px)" href="/styles/post_mobile.css">
<link rel="stylesheet" media="screen and (min-width: 600px)" href="/styles/navigatebar.css">
<link rel="stylesheet" media="screen and (max-width: 600px)" href="/styles/navigatebar_mobile.css">
<link rel="stylesheet" href="/theme/highlight.css">

</head>
<body>
<div class="navigatebar">
    <div class="navigatebar-button navigatebar-mine">
        <a href="/index.html">Free World</a>
    </div>
    <div class="navigatebar-slogan">
        「生活可以更简单, 欢迎来到我的开源世界」
    </div>
    <div class="navigatebar-button">
        <a href="/index.html">Home</a>
    </div>
    <div class="navigatebar-button">
        <a href="/tags.html">Tags</a>
    </div>
    <div class="navigatebar-button">
        <a href="/rss.xml">Feeds</a>
    </div>
    <div class="navigatebar-button navigatebar-about">
        <a href="/about.html">About</a>
    </div>
</div>

      <div class="content-area">
<div class="title">div纯css自适应居中</div>
<div class="category-area"><a href="https://bruceasu.github.io/tags.html#web"><div class="category">web</div></a> </div>
<div class="char-counter">2016-05-29</div>
        <div id="content">


<div id="outline-container-org004e91b" class="outline-2">
<h2 id="org004e91b">DIV纯CSS自适应居中</h2>
<div class="outline-text-2" id="text-org004e91b">
<div class="org-src-container">
<pre class="src src-html"><span style="font-style: italic;">&lt;!DOCTYPE html&gt;</span>
&lt;<span style="font-weight: bold;">html</span> <span style="font-weight: bold; font-style: italic;">lang</span>=<span style="font-style: italic;">"zh-CN"</span>&gt;
  <span style="font-weight: bold; font-style: italic;">&lt;!--</span><span style="font-weight: bold; font-style: italic;">&lt;![endif]</span><span style="font-weight: bold; font-style: italic;">--&gt;</span>
  &lt;<span style="font-weight: bold;">head</span>&gt;
    &lt;<span style="font-weight: bold;">meta</span> <span style="font-weight: bold; font-style: italic;">charset</span>=<span style="font-style: italic;">"UTF-8"</span> /&gt;
    &lt;<span style="font-weight: bold;">meta</span> <span style="font-weight: bold; font-style: italic;">http-equiv</span>=<span style="font-style: italic;">"Content-Type"</span> <span style="font-weight: bold; font-style: italic;">content</span>=<span style="font-style: italic;">"text/html; charset=utf-8"</span> /&gt;
    &lt;<span style="font-weight: bold;">title</span>&gt;<span style="font-weight: bold; text-decoration: underline;">DIV&#32431;CSS&#33258;&#36866;&#24212;&#23621;&#20013;[&#20860;&#23481;IE7+ CHROME FF&#31561;]</span>&lt;/<span style="font-weight: bold;">title</span>&gt;
    &lt;<span style="font-weight: bold;">style</span> <span style="font-weight: bold; font-style: italic;">type</span>=<span style="font-style: italic;">"text/css"</span>&gt;
      .pop-wrap {
      position:fixed;
      top:0;
      background:rgba(0,0,0,.8);
      left:0;
      width:100%;
      height:100%;
      }
      .pop-wrap table {
      height:100%;
      width:100%;
      }
      .pop-wrap td {
      width:100%;
      height:100%;
      }
      div.pop {
      margin:0 auto;
      width:200px;
      background:#ECECEC;
      padding:20px;
      text-align:center;
      }
      div.pop p {
      font:200 14px/20px Microsoft YaHei;
      }
      div.pop input {
      background:#FFFFFF;
      border:1px solid #ADADAD;
      padding:3px 10px;
      border-radius:2px;
      cursor:pointer;
      }
    &lt;/<span style="font-weight: bold;">style</span>&gt;
  &lt;/<span style="font-weight: bold;">head</span>&gt;
  &lt;<span style="font-weight: bold;">body</span>&gt;
    <span style="font-weight: bold; font-style: italic;">&amp;nbsp;</span>

    fdsfsdfsadfsdafsdafdssad
    &lt;<span style="font-weight: bold;">div</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">"pop-wrap"</span>&gt;
      &lt;<span style="font-weight: bold;">table</span>&gt;
        &lt;<span style="font-weight: bold;">tbody</span>&gt;
          &lt;<span style="font-weight: bold;">tr</span>&gt;
            &lt;<span style="font-weight: bold;">td</span>&gt;
              &lt;<span style="font-weight: bold;">div</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">"pop"</span>&gt;

                &#24863;&#35273;&#22914;&#20309;&#65311;

                &lt;<span style="font-weight: bold;">input</span> <span style="font-weight: bold; font-style: italic;">type</span>=<span style="font-style: italic;">"button"</span> <span style="font-weight: bold; font-style: italic;">value</span>=<span style="font-style: italic;">"&#30830;&#23450;"</span> /&gt;

            &lt;/<span style="font-weight: bold;">div</span>&gt;&lt;/<span style="font-weight: bold;">td</span>&gt;
          &lt;/<span style="font-weight: bold;">tr</span>&gt;
        &lt;/<span style="font-weight: bold;">tbody</span>&gt;
      &lt;/<span style="font-weight: bold;">table</span>&gt;
    &lt;/<span style="font-weight: bold;">div</span>&gt;
  &lt;/<span style="font-weight: bold;">body</span>&gt;
&lt;/<span style="font-weight: bold;">html</span>&gt;

</pre>
</div>
</div>
</div>

        </div>    </div>
    <div id="postamble" class="status"><div id="archive" style="padding-top: 3em; padding-bottom: 2em;"><a href="/archive.html">其它文章</a></div><script src="/js/av-min-1.5.0.js"></script>    </div>
</body>
</html>
